In [1]:
import pandas as pd

In [23]:
df = pd.read_html('https://sos.ga.gov/elections/election_results/2011_0215/00678.htm')

In [24]:
df = df[2]

In [25]:
df.shape

(6, 14)

In [26]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,NaN,NaN,Brown (D) 458,Dewitt (R) 892,Herrin (R) 547,Moxley (R) 822,"Nimmer (R) 2,901","Totals 5,620",NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,8.1%,15.9%,9.7%,14.6%,51.6%,100.0%,NaN,NaN,NaN,NaN,NaN,NaN
2,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,BRANTLEY,100%,118,79,370,183,639,1389,NaN,NaN,NaN,NaN,NaN,NaN
4,PIERCE,100%,109,46,131,135,1993,2414,NaN,NaN,NaN,NaN,NaN,NaN

In [27]:
df = df[3:]

In [28]:
df.head()

         0     1    2    3    4    5     6     7   8   9   10  11  12  13
3  BRANTLEY  100%  118   79  370  183   639  1389 NaN NaN NaN NaN NaN NaN
4    PIERCE  100%  109   46  131  135  1993  2414 NaN NaN NaN NaN NaN NaN
5     WAYNE  100%  231  767   46  504   269  1817 NaN NaN NaN NaN NaN NaN

In [29]:
df = df[df.columns[[0,2,3,4,5,6]]]

In [30]:
df.head()

          0    2    3    4    5     6
3  BRANTLEY  118   79  370  183   639
4    PIERCE  109   46  131  135  1993
5     WAYNE  231  767   46  504   269

In [31]:
df.columns = ['county', 'Jeana Brown', 'Gerald DeWitt', 'Van Herrin', 'George Moxley', 'Chad Nimmer']

In [32]:
df.tail()

     county Jeana Brown Gerald DeWitt Van Herrin George Moxley Chad Nimmer
3  BRANTLEY         118            79        370           183         639
4    PIERCE         109            46        131           135        1993
5     WAYNE         231           767         46           504         269

In [33]:
df = df.melt(id_vars=['county'])

In [34]:
df.columns = ['county', 'candidate', 'votes']

In [35]:
df.head()

     county      candidate votes
0  BRANTLEY    Jeana Brown   118
1    PIERCE    Jeana Brown   109
2     WAYNE    Jeana Brown   231
3  BRANTLEY  Gerald DeWitt    79
4    PIERCE  Gerald DeWitt    46

In [36]:
df['votes'] = df['votes'].astype(int)

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   county     15 non-null     object
 1   candidate  15 non-null     object
 2   votes      15 non-null     int64
dtypes: int64(1), object(2)
memory usage: 488.0+ bytes

In [38]:
df['office'] = 'State House'
df['district'] = '178'

# df['office'] = 'State Senate'
# df['district'] = ''

# df['party'] = 'Nonpartisan'
# df['party'] = 'Democrat'
df['party'] = 'Republican'

df.loc[(df['candidate'] == 'Jeana Brown'),'party'] = 'Democrat'

In [39]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate      party
Chad Nimmer    Republican    2901
George Moxley  Republican     822
Gerald DeWitt  Republican     892
Jeana Brown    Democrat       458
Van Herrin     Republican     547
Name: votes, dtype: int64

In [40]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county       office district       party      candidate  votes
0  BRANTLEY  State House      178    Democrat    Jeana Brown    118
1    PIERCE  State House      178    Democrat    Jeana Brown    109
2     WAYNE  State House      178    Democrat    Jeana Brown    231
3  BRANTLEY  State House      178  Republican  Gerald DeWitt     79
4    PIERCE  State House      178  Republican  Gerald DeWitt     46

In [41]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')